<script setup>
import { Disclosure, DisclosureButton, DisclosurePanel } from "@headlessui/vue";
const questionsArray = [
  {
    question: "Я не умею рисовать, смогу ли я стать дизайнером?",
    answer:
      "Художественное образование и умение рисовать — не понадобятся на курсе и в реальной работе. В обучении будет модуль с иллюстрациями, в котором ты с первого урока научишься пошагово создавать 2D графику для твоих проектов. Также, есть модуль с креативным мышлением, на котором мы разберём методы генерации идей и создания интересных проектов.",
  },
  {
    question: "Как будет проходить обучение?",
    answer:
      "Обучение состоит из 6-ти модулей. В каждом модуле ты проходишь короткие видео-уроки и закрепляешь их домашними заданиями. В конце каждого модуля тебя ждёт дипломная работа, которая является итогом всех полученных в модуле знаний и пойдёт в твоё портфолио. Раз в неделю я подключаюсь и делаю видео-разбор всех домашек, которые пойдут в портфолио, прохожусь по макетам, смотрю где есть ошибки и объясняю как их можно исправить.",
  },
  {
    question: "Что будет если я не успею обучиться за 6 месяцев?",
    answer:
      "Если понадобится перерыв в обучении — мы предоставим академический отпуск, для этого нужно написать в поддержку. Ссылка будет в твоём личном кабинете на платформе обучения",
  },
  {
    question: "Сколько будет проектов в моём портфолио?",
    answer:
      "Мы пройдём 6 модулей, в которых будут мини-домашки и дипломные работы. Всего ты сделаешь 8 проектов для портфолио, чтобы максимально раскрыть твои навыки для будущих клиентов и работодателей. <br> <br>В твоём портфолио будет: плакат, 2D иллюстрация, лендинг, интернет-магазин, мобильное приложение, сервис на desktop, 3D постер и 3D проект.",
  },
  {
    question: "Вы гарантируете, что я смогу окупить курс?",
    answer:
      "Последний модуль на курсе посвящён сборке кейсов на behance и notion, трудоустройству и поиску клиентов на фрилансе. Сможешь ли ты окупить курс и трудоустроиться — зависит от степени твоей вовлечённости при прохождении курса. <br> <br>Я могу гарантировать, что следуя урокам ты соберёшь портфолио, научишься писать сопроводительные письма и по итогу сможешь откликаться на вакансии. Также на уроках по фрилансу ты получишь 10 способов поиска клиентов, научишься процессу работы с ними и отработке возражений для продажи своих проектов на высокие чеки. Этот модуль выстроен так, что применяя уроки на практике, ты сможешь найти клиентов ещё во время обучения.",
  },
];
</script>
<template>
  <div class="w-full px-0 sm:px-4 pt-0 flex flex-col gap-2">
    <div class="mx-auto w-full rounded-2xl bg-white p-2 flex flex-col">
      <Disclosure
        v-slot="{ open }"
        v-for="element in questionsArray"
        :key="element"
        class="mb-4"
        as="div"
      >
        <DisclosureButton
          class="text-white-default w-full flex flex-row items-center justify-between bg-[#161616] py-6 px-6 border border-[#2C2C2D] gap-4"
          :class="open ? 'rounded-t-[24px] border-b-0 pb-3' : 'rounded-[24px] '"
        >
          <span
            class="font-bold text-xl leading-[120%] text-start sm:text-2xl"
            >{{ element.question }}</span
          >
          <img
            v-if="!open"
            src="@/assets/icons/Union.png"
            class="h-5 w-5"
            alt=""
          />
          <img v-else src="@/assets/icons/minus.png" alt="" />
        </DisclosureButton>

        <DisclosurePanel
          class="bg-[#161616] pb-6 px-6 rounded-b-[24px] text-gray border border-[#2C2C2D] border-t-0"
          v-html="element.answer"
        >
        </DisclosurePanel>
      </Disclosure>
    </div>
  </div>
</template>
