<script setup>
import NavMenu from "../NavMenu.vue";
function smoothScrollToId(id) {
  const element = document.getElementById(id);
  if (element) {
    const offsetTop = element.offsetTop;
    window.scrollTo({
      top: offsetTop,
      behavior: "smooth",
    });
  }
}
</script>

<template>
  <div
    class="h-auto bg-main-block bg-cover bg-no-repeat flex flex-col justify-start items-center font-manrope pb-10 sm:pb-20"
  >
    <NavMenu />
    <div
      class="container flex flex-col justify-around items-center gap-[56px] h-full px-6 sm:px-0 mt-[32px]"
    >
      <div class="flex flex-col gap-4 items-center max-w-[832px]">
        <div
          class="w-fit bg-[#19191A] text-white-default px-6 py-2 rounded-[22px]"
        >
          Онлайн-курс с полного нуля
        </div>
        <h5
          class="font-extrabold text-[34px] sm:text-[80px] text-white-default text-center leading-[102%] tracking-[-2px]"
        >
          <span>Стань дизайнером</span> <br />
          <span class="text-color1">и собери портфолио</span>
        </h5>
        <p class="text-gray text-lg sm:text-2xl text-center">
          Обучайся в своём темпе: получи востребованные навыки
          <br class="hidden sm:block" />и 7 крепких проектов для твоего
          трудоустройства
        </p>
        <button
          type="button"
          @click="smoothScrollToId('tariffs')"
          class="mt-5 sm:mt-2 bg-gradient-to-r from-[#04C7FF] to-[#019FFE] text-white-default font-bold rounded-[22px] text-lg sm:text-2xl p-[32px] border-8 border-[#19191A] w-full sm:w-auto"
        >
          Начать учиться
        </button>
      </div>
      <div
        class="w-full flex flex-col sm:flex-row justify-between items-center gap-[16px]"
      >
        <div
          class="w-full flex flex-col items-start justify-start gap-5 border-t border-[#02A4FE] py-5"
        >
          <svg
            width="24"
            height="24"
            viewBox="0 0 24 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <g clip-path="url(#clip0_402_19282)">
              <path
                d="M12.0001 24C18.5635 24 24.0001 18.575 24.0001 12C24.0001 5.43659 18.5635 0 11.9885 0C5.4251 0 0.00012207 5.43659 0.00012207 12C0.00012207 18.575 5.43671 24 12.0001 24ZM12.0001 22.1413C6.99335 22.1413 2.75327 18.3892 1.98657 13.5682C2.05627 13.5799 2.11435 13.5799 2.18405 13.5799C3.42703 13.5799 4.25182 12.5227 4.25182 10.908C4.25182 10.3969 4.34475 10.2459 4.68163 10.0833L5.4251 9.73475C5.82006 9.53727 6.18018 9.68829 6.42413 10.0252L7.80651 12.0465C9.08434 13.8935 10.3854 14.6486 11.5819 14.6486C12.732 14.6486 13.5103 13.9167 13.5103 12.7899C13.5103 12.1278 13.1734 11.5586 12.6274 11.1985C12.2789 10.9545 12.3835 10.6757 12.6971 10.6757C15.5316 10.6757 17.0301 9.65344 17.0301 7.59729C17.0301 4.87899 14.73 4.72798 14.73 4.03098C14.73 3.61278 15.2528 3.38045 15.6129 2.54405C19.3999 4.01936 22.1415 7.72507 22.1415 12C22.1415 13.0687 21.9672 14.1026 21.6536 15.0784C21.0495 14.5789 20.5616 14.3698 19.9924 14.3698C19.5509 14.3698 19.307 14.486 19.063 14.5673C18.8191 14.637 18.7029 14.5324 18.6681 14.3233C18.5519 13.4753 18.0175 13.1384 17.1579 13.1384H16.5538C15.8452 13.1384 15.276 13.5102 14.8462 14.1723L14.6603 14.4627C14.3699 14.9158 14.1144 15.2875 13.8588 15.5315C13.6148 15.7522 13.429 15.8567 12.9527 16.0077L12.4183 16.1704C11.6052 16.4259 11.3612 17.1346 11.5819 17.9245L12.1395 19.8877C12.3486 20.6079 12.7784 20.9797 13.4754 20.9797C13.7775 20.9797 14.1492 20.8635 14.5326 20.6776L14.7068 20.5963C14.974 20.4685 15.1715 20.4221 15.369 20.4221C15.822 20.4221 16.124 20.6428 16.4725 21.0842C15.125 21.758 13.6032 22.1413 12.0001 22.1413Z"
                fill="#02A4FE"
              />
            </g>
            <defs>
              <clipPath id="clip0_402_19282">
                <rect width="24" height="24" fill="white" />
              </clipPath>
            </defs>
          </svg>
          <div class="flex flex-col gap-2">
            <h1 class="text-xl sm:text-2xl font-bold text-white-default">
              Ценные навыки для всего мира
            </h1>
            <p class="text-base text-gray">
              Дизайн сайтов, сервисов и приложений,2D и 3D иллюстрации,
              качественные и количественные исследования — всё, чтобы быть
              всегда в тренде
            </p>
          </div>
        </div>
        <div
          class="w-full flex flex-col items-start justify-start gap-5 py-5 border-t border-[#02A4FE]"
        >
          <svg
            width="20"
            height="24"
            viewBox="0 0 20 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M16.5321 19.1548H16.8244C18.6248 19.1548 19.822 18.165 19.822 16.0534V7.16418H14.5243C13.5722 7.16418 12.9783 6.57031 12.9783 5.61822V0H7.90685C5.9367 0 4.85265 1.07463 4.85265 3.02592V3.46897H6.30434C7.78431 3.46897 8.85893 3.81775 9.90528 4.85467L15.2596 10.209C16.2776 11.227 16.5321 12.3959 16.5321 13.8005V19.1548ZM14.7882 5.89159H19.6712C19.6241 5.57109 19.3884 5.27887 19.0302 4.91123L15.2219 1.00864C14.8731 0.650432 14.5714 0.414768 14.2509 0.377062L14.2603 5.35428C14.2603 5.73134 14.4112 5.89159 14.7882 5.89159ZM3.25013 24H12.0734C14.0907 24 15.1464 22.9348 15.1464 20.8987V13.5931H8.42531C7.22814 13.5931 6.64369 12.9992 6.64369 11.802V4.84525H3.25013C1.23285 4.84525 0.177078 5.91987 0.177078 7.95601V20.8987C0.177078 22.9442 1.23285 24 3.25013 24ZM8.53843 12.2074H14.9768C14.8636 11.802 14.6186 11.4156 14.1944 10.9819L9.22657 5.93873C8.79295 5.50511 8.42531 5.21288 8.01997 5.09034V11.6889C8.01997 12.0283 8.19907 12.2074 8.53843 12.2074Z"
              fill="#02A4FE"
            />
          </svg>
          <div class="flex flex-col gap-2">
            <h1 class="text-xl sm:text-2xl font-bold text-white-default">
              Много практики и фидбека
            </h1>
            <p class="text-base text-gray">
              Практические задания для быстрого развития и много обратной связи
              по всем дипломным проектам, чтобы стать уверенным дизайнером
            </p>
          </div>
        </div>
        <div
          class="w-full flex flex-col items-start justify-start gap-5 py-5 border-t border-[#02A4FE]"
        >
          <svg
            width="20"
            height="24"
            viewBox="0 0 20 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M9.46451 24C4.18472 24 0.69043 20.9548 0.69043 16.387C0.69043 12.356 2.59641 11.0525 2.59641 8.54404C2.59641 8.0073 2.51973 7.39388 2.51973 7.06527C2.51973 6.49566 2.87026 6.13419 3.38509 6.13419C4.35999 6.13419 5.43347 6.92287 6.07975 8.2702C6.12357 8.05112 6.13452 7.85395 6.13452 7.63487C6.12357 5.53172 4.86387 3.75719 3.51654 2.13601C3.27555 1.85121 3.13315 1.52259 3.13315 1.21588C3.13315 0.416248 3.86706 0 4.98436 0C10.8337 0 19.3011 4.14058 19.3011 14.0429C19.3011 20.0237 15.3577 24 9.46451 24ZM9.7274 20.6262C12.2797 20.6262 13.5941 18.7859 13.5941 16.5952C13.5941 14.4044 12.3235 12.0602 9.95743 10.9758C9.82598 10.921 9.71645 10.9977 9.73835 11.1401C9.93552 12.8489 9.71645 14.4372 9.1578 15.2807C8.8949 14.6235 8.57724 14.0758 8.09527 13.6376C7.97477 13.539 7.87619 13.5938 7.85428 13.7252C7.67902 15.0397 6.34264 15.675 6.34264 17.581C6.34264 19.4103 7.68997 20.6262 9.7274 20.6262Z"
              fill="#02A4FE"
            />
          </svg>
          <div class="flex flex-col gap-2">
            <h1 class="text-xl sm:text-2xl font-bold text-white-default">
              Сильное портфолио
            </h1>
            <p class="text-base text-gray">
              Уникальное для каждого участника обучения, чтобы выделиться на
              рынке дизайна среди остальных и показать широкий спектр навыков
            </p>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
